УТ_для_edt/src/DataProcessors/смартСверкаИКорректировкаСерийАдмирал/смартСверкаИКорректировкаСерийАдмирал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартСверкаИКорректировкаСерийАдмирал</name>
</mdclass:DataProcessor>

УТ_для_edt/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОтгрузкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОформлениюГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКСборкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобираетсяГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобраноГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Documents/ОрдерНаОтражениеПересортицыТоваров/ОрдерНаОтражениеПересортицыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОрдерНаОтражениеПересортицыТоваров</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.смартСвободныеОстаткиОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</registerRecords>
  <registerRecords>AccumulationRegister.смартТоварыНаСкладахОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВЯчейках</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЗапчастиГарантийные</name>
    <comment>//смарт:ММ 221 18.07.2021</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураОприходование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаОприходование</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеОприходование</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаОприходование</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияОприходование</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерийОприходование</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОприходование</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииНоменклатуры</name>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>DefinedType.НомерСерии</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>DefinedType.НомерКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>EPCGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDМеткаНеЧитаемая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Справка2ЕГАИС</name>
    <type>
      <types>CatalogRef.Справки2ЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительВЕТИС</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьСкладскогоЖурналаВЕТИС</name>
    <type>
      <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПартииВЕТИС</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяРозничнаяЦенаМОТП</name>
    <comment>Максимальная розничная цена (МОТП)</comment>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусПроверкиОборудования</name>
    <comment>++ #1250 Фролов 17.11.2022 //Проверенное оборудование. &quot;Запрет на отгрузку без проверки оборудования  #1143 &quot;</comment>
    <type>
      <types>EnumRef.смартСтатусыПроверкиОборудованияПоСерии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартДанныеУпаковочногоЛиста</name>
    <comment>//++ #Б1140 смарт: Шляпников 02.09.2025 / Учет данных по упаковочным листам.</comment>
    <attributes>
      <name>ТипУпаковки</name>
      <type>
        <types>EnumRef.смартТипыУпаковокУпаковочногоЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Хрупкое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/смартСверкаИКорректировкаСерийАдмирал/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СвязатьТаблицыОстатковПоОтбору();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытия

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ЗагрузитьОстаткиСмарт();
	ЗагрузитьОстаткиАдмирал();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковПриАктивизацииСтроки(Элемент)
	
	СвязатьТаблицыОстатковПоОтбору();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТекущиеСтрокиОстатковВОрдер(Команда = Неопределено)
	
	Если Элементы.ТаблицаОстатков.ТекущаяСтрока = Неопределено ИЛИ Элементы.ТаблицаАдмирал.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаОстатков = ТаблицаОстатков.НайтиПоИдентификатору(Элементы.ТаблицаОстатков.ТекущаяСтрока);
	ТекущаяСтрокаОстатковАдмирал = ТаблицаАдмирал.НайтиПоИдентификатору(Элементы.ТаблицаАдмирал.ТекущаяСтрока);
	
	Количество = Мин(ТекущаяСтрокаОстатков.Количество, ТекущаяСтрокаОстатковАдмирал.Количество);
	Если Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Товары.Добавить();
	НоваяСтрока.Номенклатура = ТекущаяСтрокаОстатков.Номенклатура;
	НоваяСтрока.Характеристика = ТекущаяСтрокаОстатков.Характеристика;
	НоваяСтрока.Серия = ТекущаяСтрокаОстатков.Серия;
	НоваяСтрока.Назначение = ТекущаяСтрокаОстатков.Назначение;
	НоваяСтрока.Количество = Количество;
	
	НоваяСтрока.НоменклатураОприходование = ТекущаяСтрокаОстатковАдмирал.Номенклатура;
	НоваяСтрока.СерияОприходование = ТекущаяСтрокаОстатковАдмирал.Серия;
	НоваяСтрока.КоличествоОприходование = Количество;
	НоваяСтрока.СерияАдмирал = ТекущаяСтрокаОстатковАдмирал.СерияАдмирал;
	
	НоваяСтрока.ХарактеристикаОприходование = ТекущаяСтрокаОстатков.Характеристика;
	НоваяСтрока.НазначениеОприходование = ТекущаяСтрокаОстатков.Назначение;
	
	ТекущаяСтрокаОстатков.Количество = ТекущаяСтрокаОстатков.Количество - Количество;
	ТекущаяСтрокаОстатковАдмирал.Количество = ТекущаяСтрокаОстатковАдмирал.Количество - Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	СкорректироватьОстаткиПриИзмененииСтрокиОрдера(ТекущаяСтрока.Количество, ТекущаяСтрока.КоличествоОприходование, Элементы.Товары.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАдмиралВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДобавитьТекущиеСтрокиОстатковВОрдер();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрдер(Команда)
	
	СоздатьОрдерНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОтборПриИзменении(Элемент)
	
	ЗагрузитьОстаткиСмарт();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Товары.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	ТекущееКоличествоСписываемое = ТекущаяСтрока.Количество;
	ТекущееКоличествоПриходуемое = ТекущаяСтрока.КоличествоОприходование;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущаяСтрока = Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	ТекущаяСтрока.Количество = Мин(ТекущееКоличествоСписываемое, ТекущаяСтрока.Количество);
	ТекущаяСтрока.КоличествоОприходование = ТекущаяСтрока.Количество;
	
	СкорректироватьОстаткиПриИзмененииСтрокиОрдера(ТекущееКоличествоСписываемое - ТекущаяСтрока.Количество,
												   ТекущееКоличествоПриходуемое - ТекущаяСтрока.КоличествоОприходование,
												   Элементы.Товары.ТекущаяСтрока);
												   
	ТекущееКоличествоПриходуемое = ТекущаяСтрока.КоличествоОприходование;
	ТекущееКоличествоСписываемое = ТекущаяСтрока.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияОприходованиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидНоменклатуры = ПолучитьВладельцаСерий(Элементы.Товары.ТекущиеДанные.НоменклатураОприходование);
	ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаВыбора", Новый Структура("ВидНоменклатуры", ВидНоменклатуры), Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьОстаткиСмарт()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Данные.Номенклатура КАК Номенклатура,
	|	Данные.Характеристика КАК Характеристика,
	|	Данные.Назначение КАК Назначение,
	|	Данные.Серия КАК Серия,
	|	СУММА(Данные.ВНаличииОстаток) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|		ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|		ТоварыНаСкладахОстатки.Назначение КАК Назначение,
	|		ТоварыНаСкладахОстатки.Серия КАК Серия,
	|		ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКОтгрузкеОстатки.Номенклатура,
	|		ТоварыКОтгрузкеОстатки.Характеристика,
	|		ТоварыКОтгрузкеОстатки.Назначение,
	|		ТоварыКОтгрузкеОстатки.Серия,
	|		-ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток - ТоварыКОтгрузкеОстатки.ВРезервеОстаток
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &Склад) КАК ТоварыКОтгрузкеОстатки) КАК Данные
	|ГДЕ
	|	Данные.Номенклатура В ИЕРАРХИИ(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.Серия,
	|	Данные.Назначение,
	|	Данные.Характеристика,
	|	Данные.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(Данные.ВНаличииОстаток) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Данные.Номенклатура.Наименование,
	|	Данные.Серия.Наименование";
	
	Запрос.УстановитьПараметр("Склад", Справочники.смартПредопределенныеЗначения.СкладАдмирал.Значение);
	Если НоменклатураОтбор.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("Номенклатура", НоменклатураОтбор);
	Иначе
		ТекстЗамены = "ГДЕ
					  |	Данные.Номенклатура В ИЕРАРХИИ(&Номенклатура)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстЗамены, "");
	КонецЕсли;
	
	ТаблицаОстатков.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для каждого стрТовары Из Товары Цикл
		СкорректироватьОстаткиПриИзмененииСтрокиОрдера(-стрТовары.Количество, 0, стрТовары.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОстаткиАдмирал()
	
	ДанныеАдмирал = Неопределено;
	КоличествоПопыток = 5;
	ТаблицаАдмирал.Очистить();
	
	НомерПопытки = 0;
	Пока НомерПопытки < КоличествоПопыток Цикл
		
		НомерПопытки = НомерПопытки + 1;
		
		Попытка
			ДанныеАдмирал = смартИнтеграцияСАдмирал.ПолучитьОстаткиАдмирал(ТекущаяДата());
			Прервать;
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
		
	Если ТипЗнч(ДанныеАдмирал) = Тип("Структура") И ДанныеАдмирал.Свойство("goods") Тогда
		
		ТЗЗагрузки = ТаблицаАдмирал.Выгрузить();
		
		Для каждого стрТовары Из ДанныеАдмирал.goods Цикл
			
			НоваяСтрока = ТЗЗагрузки.Добавить();
			
			НоваяСтрока.Код1С = стрТовары.product_id_ext;
			НоваяСтрока.НаименованиеАдмирал = стрТовары.product_name;
			НоваяСтрока.СерияАдмирал = стрТовары.serial;
			НоваяСтрока.Количество = стрТовары.quantity;
			
			МассивКодАртикул = СтрРазделить(НоваяСтрока.Код1С, ".", Истина);
			Если МассивКодАртикул.Количество() = 1 Тогда
				НоваяСтрока.Номенклатура = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.НайтиНоменклатуруПоКодуИлиАртикулу(МассивКодАртикул[0]);
			ИначеЕсли МассивКодАртикул.Количество() = 2 Тогда
				НоваяСтрока.Номенклатура = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.НайтиНоменклатуруПоКодуИлиАртикулу(МассивКодАртикул[0], МассивКодАртикул[1]);
			Иначе
				КодДляПоиска = МассивКодАртикул[МассивКодАртикул.Количество() - 1];
				АртикулДляПоиска = Лев(НоваяСтрока.Код1С, СтрДлина(НоваяСтрока.Код1С) - СтрДлина(КодДляПоиска) - 1);
				НоваяСтрока.Номенклатура = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.НайтиНоменклатуруПоКодуИлиАртикулу(АртикулДляПоиска, КодДляПоиска);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоваяСтрока.СерияАдмирал) И ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
				НоваяСтрока.Серия = Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.НайтиСериюНоменклатуры(НоваяСтрока.Номенклатура, НоваяСтрока.СерияАдмирал);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоваяСтрока.СерияАдмирал) И НЕ ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
				НоваяСтрока.РасхождениеПоСерии = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		ТЗЗагрузки.Свернуть("Код1С,НаименованиеАдмирал,СерияАдмирал,Номенклатура,Серия,РасхождениеПоСерии", "Количество");
		ТЗЗагрузки.Сортировать("НаименованиеАдмирал ВОЗР,СерияАдмирал ВОЗР");
		ТаблицаАдмирал.Загрузить(ТЗЗагрузки);
		
	КонецЕсли;
	
	Для каждого стрТовары Из Товары Цикл
		СкорректироватьОстаткиПриИзмененииСтрокиОрдера(0, -стрТовары.КоличествоОприходование, стрТовары.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СвязатьТаблицыОстатковПоОтбору()
	
	Если Элементы.ТаблицаОстатков.ТекущаяСтрока = Неопределено Тогда
		
		Если ТипЗнч(Элементы.ТаблицаАдмирал.ОтборСтрок) = Тип("ФиксированнаяСтруктура") И Элементы.ТаблицаАдмирал.ОтборСтрок.Свойство("Номенклатура") Тогда
			Если Элементы.ТаблицаАдмирал.ОтборСтрок.Номенклатура = Неопределено Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Элементы.ТаблицаАдмирал.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", Неопределено);
		
	Иначе
		
		ТекущаяСтрокаОстатков = ТаблицаОстатков.НайтиПоИдентификатору(Элементы.ТаблицаОстатков.ТекущаяСтрока);
		
		Если ТипЗнч(Элементы.ТаблицаАдмирал.ОтборСтрок) = Тип("ФиксированнаяСтруктура") И Элементы.ТаблицаАдмирал.ОтборСтрок.Свойство("Номенклатура") Тогда
			Если Элементы.ТаблицаАдмирал.ОтборСтрок.Номенклатура = ТекущаяСтрокаОстатков.Номенклатура Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
			
		Элементы.ТаблицаАдмирал.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", ТекущаяСтрокаОстатков.Номенклатура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкорректироватьОстаткиПриИзмененииСтрокиОрдера(Количество, КоличествоОприходование, ИдентификаторСтроки)
	
	строкаТовары = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтрокиТаблицаОстатков = ТаблицаОстатков.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,Серия,Назначение",
								строкаТовары.Номенклатура, строкаТовары.Характеристика, строкаТовары.Серия, строкаТовары.Назначение));
								
	Если СтрокиТаблицаОстатков.Количество() > 0 Тогда
		СтрокиТаблицаОстатков[0].Количество = СтрокиТаблицаОстатков[0].Количество + Количество;
	КонецЕсли;
	
	СтрокиТаблицаАдмирал = ТаблицаАдмирал.НайтиСтроки(Новый Структура("Номенклатура,Серия,СерияАдмирал",
																		строкаТовары.НоменклатураОприходование, 
																		строкаТовары.СерияОприходование, 
																		строкаТовары.СерияАдмирал));
								
	Если СтрокиТаблицаАдмирал.Количество() > 0 Тогда
		СтрокиТаблицаАдмирал[0].Количество = СтрокиТаблицаАдмирал[0].Количество + КоличествоОприходование;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОрдерНаСервере()
	
	Если Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Ордер = Документы.ОрдерНаОтражениеПересортицыТоваров.СоздатьДокумент();
	Ордер.Дата = ТекущаяДатаСеанса();
	Ордер.Ответственный = Пользователи.АвторизованныйПользователь();
	Ордер.Склад = Справочники.смартПредопределенныеЗначения.СкладАдмирал.Значение;
	Ордер.Комментарий = "Создан из обработки по данным полученным по АПИ Адмирал";
	
	Ордер.Товары.Загрузить(Товары.Выгрузить());
	
	Для каждого стрТовары Из Ордер.Товары Цикл
		
		стрТовары.КоличествоУпаковок = стрТовары.Количество;
		
		Если ЗначениеЗаполнено(стрТовары.Серия) Тогда
			стрТовары.СтатусУказанияСерий = 14;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стрТовары.СерияОприходование) Тогда
			стрТовары.СтатусУказанияСерийОприходование = 14;
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		Ордер.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(СтрШаблон("Не удалось создать ордер по приичне %1", ОписаниеОшибки()));
		Возврат;
	КонецПопытки;
	
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан документ %1", Ордер.Ссылка), Ордер.Ссылка);
	
	Товары.Очистить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВладельцаСерий(Номенклатура)
	
	Возврат Обработки.смартЗагрузкаСкладскихОрдеровИзАдмирал.ПолучитьВладельцаСерий(Номенклатура);
	
КонецФункции

#КонецОбласти
